{"parent_hash": "QmRXG3JcdTeqPE4steUsb7JoJPrKXwrGMaddjVA2MxF5bW", "username": "sudde004", "profile_pic": "https://styles.redditmedia.com/t5_17lty3/styles/profileIcon_snoo49808b90-7b60-476c-b5b9-7146568dfe62-headshot.png?width=256&height=256&crop=256:256,smart&s=81ae09519e92bb5d55e75f87f61ccc5f33c208c4", "body": " Copy Paste for those who need to read the text:\n\n\nFOR IMMEDIATE RELEASE ____________________________________________________________________\nREP. LAUREN BOEBERT WAS AN UNLICENSED PAID ESCORT WITH SUGARDADDYMEET.COM AND HAD TWO ABORTIONS\nBOEBERT MET SENATOR TED CRUZ IN ASPEN THROUGH KOCH FAMILY MEMBER ESCORT CLIENT\nBOEBERT HAD AN ABORTION AT PLANNED PARENTHOOD IN\nGLENWOOD SPRINGS, COLORADO DUE TO HER WORK WITH SUGARDADDYMEET.COM\nJune 14, 2022 - SILT, COLORADO: The American Muckrakers PAC, Inc., today announced their team and volunteers have uncovered that Lauren Boebert was an unlicensed, paid escort and met clients through SugarDaddyMeet.com. Text messages show she was bankrupt at the time and looking for “side income” and called her work “pay to play”. She was paid to “escort” wealthy men.\nAccording to our investigation, in 2019, Boebert was hired by a wealthy male client in Aspen, Colorado, who was a Koch family member. Boebert’s rich client subsequently introduced her to U.S. Senator Ted Cruz (R- TX) in Aspen in 2019. After meeting with Senator Cruz, Boebert was encouraged by him to run for U.S. Congress. After Boebert announced her campaign for Congress in December 2019, Senator Cruz donated $126,000.00 to the Boebert Campaign and helped her raise large sums of money during trips Boebert made to Texas.\nBoebert didn’t disclose a $75,000 donation until Cruz’s Federal Election Commission filings contradicted her filings.\nBoebert had an abortion at the Planned Parenthood Clinic in Glenwood Springs, Colorado, due to her work with a SugarDaddyMeet.com client. Boebert also had another abortion at a clinic in Grand Junction, Colorado. It is not known whether the second abortion Boebert had was related to the Aspen client or a different SugarDaddyMeet.com client or someone else.\nAmerican Muckrakers obtained this information through an exhaustive investigation and a tip from a verified source close to this matter who has requested anonymity for fear of reprisals.\n(continued)\n  1 | Page\n\n BOEBERT PAID ESCORT/ABORTION PRESS RELEASE Page 2.\nJune 14, 2022\nDavid B. Wheeler, President of the American Muckrakers PAC, Inc, said the following:\n“Lauren Opal Boebert is as big of a hypocrite as Madison Cawthorn. He says one thing and does another. She says she is against abortion but has apparently had at least two abortions. She claims to be a devout Christian but is paid to escort wealthy men without a license and has two abortions she wants to make illegal for other women. She takes money from Ted Cruz but doesn’t report it. If she is a law and order candidate, imagine what else she’ll do to line her pockets. There is clearly no moral line Boebert won’t cross and it’s all about getting as much money as she can, not the needs of the citizens of Colorado.\nOur coalition of Republicans, Democrats, and Unaffiliated voters are pleading with all voters in Colorado’s 3rd District to take a good long look at Lauren Boebert and what she does, not what she says:\n- Boebert had two abortions but says other women shouldn’t be able to make this decision.\n- Boebert was driving an ATV in Moab and had a serious wreck with her son in the back and her\nsister-in-law is so seriously injured she has to be flown to the hospital via life flight.\n- Boebert doesn’t report the accident as required by Utah law and then actively works to cover up the accident two weeks before the primary election, including paying her sister-in-law off to\nremain silent.\n- Boebert uses donor money to pay her taxes and restaurant rent.\n- Boebert still owes her employees back pay and threatens them if they protest.\n- Jayson Boebert has a “consulting” contract for an oil and gas company for $460,000.00 a year\nbut has zero consulting experience.\nWe hope Coloradans will agree with us that Lauren Boebert doesn’t deserve to represent the voters of Colorado, but she does deserve to be in the Colorado Hypocrite Hall of Fame. “\nMore information on this matter is at: FireBoebert.com/BoebertAbortions\n##\nAmerican Muckrakers PAC, Inc, contact: (970) 610-6001 or press@fireboebert.com\nMore about American Muckrakers PAC, Inc.: American Muckrakers PAC, Inc., is a non-profit political action committee dedicated solely to ensuring terrible politicians are held accountable and hopefully fired. Our first fight was against Rep. Madison Cawthorn (FireMadison.com); he was fired on May 17, 2022. Our current fight is against Lauren Boebert. We are an FEC registered Super PAC. For more information about us: FireMadison.com and FireBoebert.com.\n  2 | Page"}