{"parent_hash": "QmRm2rfZpSnMEmwg1MrfPYVC9Rij8kLXWmqzvpNhpqSeVc", "username": "passinghere", "profile_pic": "https://www.redditstatic.com/avatars/defaults/v2/avatar_default_0.png", "body": "I just want to clear this up a bit. The SCMP says the following:\n\n>All the new textbooks said Hong Kong was never a British colony as the Chinese government had never recognised the unequal treaties or given up sovereignty over the city.\n\n>The textbooks said the United Nations removed Hong Kong from a list of colonies in 1972 after China made the demand.\n\n>Veteran Chinese history teacher Chan Chi-wa said most of the local textbooks in the 1990s and before mentioned Hong Kong as a “British colony”, but the phrase was gradually replaced by remarks saying Britain exercised colonial rule over Hong Kong before 1997.\n\nThe textbooks are trying to make a distinction between Hong Kong being a formal British colony (which would require China to have ceded its sovereignty over the territory) and Britain exercising colonial rule over territory that was still claimed by China. \n\nIt’s a partisan view – and I don’t think it’s technically correct – but it’s not nearly as unreasonable as the headline is suggesting. It’s not a 1984-style denial that there was ever a British colony there. They’re repudiating the Treaty of Nanjing and saying that the territory was not legitimately ceded (or at least that the practical concession was caveated by an ongoing claim of sovereignty?), consistent with the approach they’ve taken since at least the 70s. \n\nInternational law is barely worthy of the name – most of the time it’s just power politics dressed up with legal niceties. So whether treaties that were (inarguably) imposed on China by imperialist powers in the 19th century were legitimate is as much a matter of perspective as anything else. China is very powerful and it doesn’t think those treaties were legitimate – that’s about as close as you’ll get to a definitive legal answer. (Fun fact: a lot of the early development of international law came from the Dutch to rationalise their conquests and later genocide in south east Asia. Hugo Grotius did his best to legitimise some pretty horrific violence committed by the VOC.)\n\nLike I said, I don’t think this is technically correct. Qing China made the treaties, however unhappily, and it was the recognised government of China. But that view is premised on a western, Westphalian view of international norms and relations – and that perspective is not universal. And given how enormously evil British conduct was around that treaty I don’t think it’s worth making too much noise about either."}