{"parent_hash": "QmXjBUTjAxwsoQAfbyDFWyQSrNvyD4qXvA4noXRYYB7WwZ", "username": "removed", "profile_pic": "removed", "body": "I’m not sure about the scale of long covid, but long covid is definitely a thing. My brother in law got covid last year and it affected his brain. His mental capacity is still shot a year later. He’s just not the same person anymore\n\nEdit: people asking to elaborate.\n\nI don’t know the specifics of how it affected his brain, but that’s what we were told when he finally got to the ER. My brother in law wasn’t vaccinated when he got it, and he was ill for about a week or more before being treated. I’m not sure if he ever lost smell or taste, but he became delusional; thinking he could outrun cars, or fall from heights and not be injured, thinking god was giving him superpowers, etc. After covid, i suppose he became a bit more distant. He seemed like he was in a constant haze, like not able to recognize what he’s doing, or what’s going on. My mother in law would talk to my wife and i about him, him being right next to her, and he wouldn’t even realize we were talking about him. He definitely stopped being as jovial as he normally was. He seems to be doing better now and is starting to seem less hazy, but he’s still not how he was pre-covid, and it’s been almost a year now\n\nEdit 2: people saying this sounds more like an unrelated mental illness\n\nI understand, it sounds more manic or like mental illness. All i know is that he was fine, then he got really sick with cold/flu symptoms for a week or more before becoming delusional, then he went to the ER and they ran a covid antibody test that came back positive, and they did multiple physical/mental/psych tests on him and they determined that the covid had affected his brain, and they said they’ve had at least 2 other patients that had something similar happen to them when they got covid and left it untreated for a period of time. He was fine, got covid, and now he’s no longer fine and hasn’t been for about a year now. Maybe he has latent mental issues that haven’t manifested yet and the covid brought it to light temporarily, i have no idea, but the covid definitely had some sort of lasting effect. His brain probably became enflamed/engorged due to his illness being untreated for over a week, or perhaps the brain was infected directly or over time as it spread from being untreated. Either way, i trust our healthcare professionals’ words more so than random laypeople on the internet."}