{"parent_hash": "QmRhMgvXv1aK4kFUs7okk5dCmLMmiTnvibq6ZoDXYN1Ni6", "username": "BlueTexBird", "profile_pic": "https://styles.redditmedia.com/t5_281xha/styles/profileIcon_crxze7qubjn81.png?width=256&height=256&crop=256:256,smart&s=315ee7b25f9be57fd9bbe37a531fea1abb303c3c", "body": "Ahhh the age old argument of office chair/ergonomic chairs vs gaming chairs. Let's just put this to bed once and for all and only compare the product based on its price point category.\n\nHigh end price bracket chairs: your Herman Miller, steelcase etc. A no brainer if you want an extremely comfortable, durable and functional chair that meets all your needs. And no, there are no gaming chairs that are even close the price range of these chairs. Which basically means that there's no competition for office/ergo chairs vs gaming chairs in the this price bracket. Therefore, office/ergo chair wins this round.\n\nMid range price bracket chairs: your $300-$600 office/ergo chair startups and high end gaming chairs like secret lab, razer etc. Let's put it this way, there's no way in hell you're paying $300-$600 for mesh and plastic over memory foam cushion, steel frame and leather. You're literally being scammed in broad daylight paying premium prices for so called ergonomic/office chair that only serves 1/5 of an actual high end price bracket chair with less R&D and poor quality materials built into the chair. As for gaming chairs in this price range, you're paying for a high end gaming chair that is already at it's height of it's ceiling (no gaming chairs costs anymore than this range). And you're getting far better built quality,  materials and ergonomic (yes, gaming chairs in this price range do come with better ergonomics than some office chairs with similar price with an additional adjustable lumbar support and arm height/rotational. This round definitely 100% goes to the gaming chair without any doubt. Anyone else telling you so otherwise have probably never bought a good high end gaming chairs or are just trying to justify their crappy $300-$600 office chair being ergonomic as the main factor without even considering the much better ergonomics that current high end gaming chairs offers with much better materials and durability. \n\nBudget/low price bracket chairs: your standard office chairs and cheap gaming chairs (older dx racer, wish, Amazon gaming chairs). This is where the argument about gaming chairs being a gimmick comes to mind because majority of the people who bought cheap gaming chairs are put off by their experience and see high end gaming chairs similar because: 1) they assume all gaming chairs are built like the same ala race car buckets seats 2) everyone else is regurgitating the same crap about the same experience with little to no knowledge on the matter 3) they just have bias towards gaming chairs for no apparent reason without having even sat on one. They then justify this by comparing the cheap office chair to the budget/high end gaming chair and concluded that all gaming chairs are gimmicky. But if we were to compare solely on comfort and price in itself, the office chairs are the go to for it's no nonsense approach for just being a plain old chair. \n\nThat's just my opinion. You can agree to disagree however you like. At the end of the day, you buy a chair for a specific reason being comfort, design and durability.  So everyones expectations are different in terms what is on the market. You choose what you need and stick to it."}