{"parent_hash": "QmeCQy6KeAX5JMSzB4kxruEaW1gxXSTEocK8H7E6yPqmMn", "username": "MicroSofty88", "profile_pic": "https://styles.redditmedia.com/t5_24ubl3/styles/profileIcon_snoo6ff8b05d-e2cb-47de-8343-9c6d886cee78-headshot-f.png?width=256&height=256&crop=256:256,smart&s=77a934360607e409213ca42038438c79f95f4e83", "body": "> The Biden administration will announce as soon as Wednesday $650 million in weapons and equipment for Ukraine, including for the first time vehicle-mounted Harpoon anti-ship missiles, according to people familiar with the matter. \n> \n> The weapons package also includes $320 million for secure radios and related equipment, $55 million for thermal night-vision optics, and $160 million for training, one of the people said.\n> \n> The announcement comes as Ukrainian officials have pleaded for more weapons faster to stave off gradual Russian advances in the eastern part of the country. President Volodymyr Zelenskiy said the war may stagnate if deliveries of advanced weapons from Ukraine’s allies don’t accelerate. \n> \n> NATO ministers are meeting in Brussels with the nearly four-month-old war at the top of their agenda. US Secretary of Defense Lloyd Austin opened a meeting of the Ukraine Defense Contact Group on Wednesday pledging to maintain military support for Ukraine as the country faces a “pivotal moment” on the battlefield.\n> \n> “We can’t underestimate the challenge that Ukraine faces,” Austin said at NATO headquarters in Brussels. “Russia is using its long-range fires to try to overwhelm Ukrainian positions.”\n> \n> The US has steadily ratcheted up support for Ukraine while batting away questions about how long the flow of aid will last and whether it would support any deal that included Ukraine ceding territory to Russia.\n> \n> Meanwhile, the fallout from the conflict is driving sharp increases in the price of gasoline and food, a bitter political headwind for Biden heading into midterm elections this fall. \n> \n> “When we decided we were going to help Ukraine -- the point that I was making was that it’s going to cost us too,” Biden said at a June 10 fundraiser."}