{"parent_hash": "QmXKBBoTcYnFPfVQVhnXfYoTB9ybLz45FTfUqu1KD22jzX", "username": "ThatDamnedDame", "profile_pic": "https://styles.redditmedia.com/t5_44bi1k/styles/profileIcon_snoo33cf3268-b207-4c6c-90c9-b64ea5a85bee-headshot-f.png?width=256&height=256&crop=256:256,smart&s=7c34253ac829915605fa87fc434fb0d87aa26700", "body": "The full story, if you’re not able to load or if you’re like me and was reading through the comments and still not able to figure it out.\n\n>The Dyatlov Pass incident has inspired countless theories over the last 62 years regarding the deaths of nine Russian hikers who set out on a 200-mile trek through Russia’s Ural Mountains in the winter of 1959. According to National Geographic (citing the journal Communications Earth and Environment), engineers recently relied on animation codes that Disney used on its Oscar-winning blockbuster “Frozen” to prove a longstanding theory that an avalanche resulted in the deaths of the nine hikers.  \n>  \n>While researchers concluded in 2019 that an avalanche killed the hikers, the Dyatlov Pass incident continued to provoke theories.Per National Geographic: “Many argued that the avalanche theory, initially proposed in 1959, still didn’t seem to stack up: The team’s tent encampment was cut into the snow on a slope with an incline seemingly too mild to permit an avalanche. There was no snowfall on the night of February 1 that could have increased the weight of the snow burden on the slope and triggered a collapse.  \n>  \n>Most of the blunt force trauma-like injuries and some of the soft tissue damage were atypical of those caused by avalanches, whose victims usually asphyxiate.”**The avalanche theory has now been further supported with help from Disney’s “Frozen,” courtesy of Johan Gaume, head of a Swiss federal technical institute named the Snow Avalanche Simulation Laboratory. Gaume “was struck by how well the movement of snow was depicted” in “Frozen,” so he decided to ask the animators who worked on the Disney animated film for the code.**  \n>  \n>**As National Geographic reports: “Following a trip to Hollywood to meet with the specialist who worked on Frozen’s snow effects, Gaume modified the film’s snow animation code for his avalanche simulation models, albeit with a decidedly less entertaining purpose: to simulate the impacts that avalanches would have on the human body.”Using the “Frozen” animation codes, researchers were able to create a simulation of the Kholat Saykhl avalanche.**  \n>  \n>**Gaume worked on the project with Alexander Puzrin, a geotechnical engineer at ETH Zürich. The simulation showed that a block of snow on Kholat Saykhl could “handily break the ribs and skulls of people” in its path. Head over to National Geographic’s website to read the full report on the Dyatlov Pass incident.**"}