{"parent_hash": "QmdCykn4jVQ7VTwy2EZfZ5TsigkPN6vqUKc8cHw7hy7x8a", "username": "removed", "profile_pic": "removed", "body": "[Here's one of the better pieces of literature on the subject that tackles the issue of transgender athletes in exhaustive detail.](https://www.barbellmedicine.com/blog/shades-of-gray-sex-gender-and-fairness-in-sport/)\n\nIt's very long but the science doesn't lend itself well to convenient and snappy observations.  The end includes a summary for the TLDR crowd.\n\n> Fairness in sport, particularly on the issue of gender, has been a point of confusion and contention for as long as governing bodies have been making the rules for athletic contests. Increasing awareness and visibility of individuals who do not neatly fall into men’s or women’s divisions have exacerbated these concerns. Particular scrutiny has been applied to those who wish to compete as women. Most of the discussion here will focus on that division, since the men’s divisions have been spared this level of examination and controversy.\n\n> There has never been a “golden age” when this was simple. In the past, women were simply excluded from sport. As barriers to participation have slowly fallen, questions about who qualifies as a woman for competitive purposes have been raised and unsuccessfully addressed multiple times. Lest an appeal to a more straightforward time be made, we do not, nor have we ever, had an agreed-upon definition of what defines a man or a woman that can be applied to all humans. There is no specific biological characteristic, nor set of characteristics, including genital structures, reproductive organs, or chromosomal arrangement, that can adequately answer this question for this purpose. While most humans can be comfortably grouped into either the men’s or women’s divisions, there are others that cannot. Given that participation in sport is a widely shared and enjoyable undertaking with multiple biological, psychological, and social benefits, finding ways to maximize inclusion while preserving fairness is challenging.\n\n> Alas, there are no clear answers. Lacking a consistent way to define men and women hamstrings the proceedings from the outset. When examining the performance differences between men’s and women’s divisions, confounders in the data abound. Teasing out the physiological and psychosocial components of the differences we observe is not yet possible. Even the role of testosterone, which is one of the mostly widely utilized performance enhancing drugs and thought to be the primary arbiter of the gender gap in sports, becomes less clear when looking at the research. Lastly, there is a paucity of research into how athletic performance changes when an individual transitions between genders.\nThis handwringing is not simply an equivocation. A scientific consensus does not yet exist regarding the differences between genders, let alone how to define those genders. Because of this uncertainty, rules and policies that encourage inclusion of transgender athletes represent the best balance among the imperfect choices available. Specifically, allowing male-to-female transgender athletes to compete in the division of their choice within sport should not be considered prima facie disadvantageous to other women competitors, though this will need to be considered on a sport-by-sport basis. This situation could potentially change or be clarified with further research and we would adjust our recommendations if such findings became available. For now, developing clear and equitable division eligibility policies and subsequently, allowing transgender athletes to compete in the appropriate division is prudent."}