{"post_hash": "QmcbxRCePjuqz3YVipS23cxq3PdoEo3v3jNn2QEuDG2wxz", "parent_hash": "QmcbxRCePjuqz3YVipS23cxq3PdoEo3v3jNn2QEuDG2wxz", "parent_type": "post", "username": "g2g079", "profile_pic": "https://www.redditstatic.com/avatars/defaults/v2/avatar_default_3.png", "body": ">The Jan. 6 committee has subpoenaed documentary filmmaker Alex Holder in regard to footage and interviews Holder and his team shot while following former President Donald Trump and his inner circle throughout the 2020 presidential campaign. Holder’s company, AJH Films, confirmed to Rolling Stone on Tuesday that he has been subpoenaed, will sit for an interview with the panel on Thursday, and has “fully complied with all of the committee’s requests.”\n\n>In some of the highest ranks of the Trumpworld diaspora — including among several who testified before the Jan. 6 committee — news of the documentarian cooperating with the congressional panel (and also potentially having reams of behind-the-scenes footage of Trump’s crusade to nullify the 2020 election) came as a bizarre surprise. “What the fuck is this?” a former top Trump 2020 official messaged Rolling Stone on Tuesday after seeing the Politico item.\n\n>Another former senior official on the reelection team insisted that the first time several members of the Trump campaign leadership even heard of the documentary was when Politico reported the committee had subpoenaed the Holder. A third ex-official simply said, “Terrible idea,” and pleaded baffled ignorance to the doc project.\n\n>Two former senior Trump administration officials, who were still working in the administration after the Jan. 6 riot, also claimed that they each had no idea the documentary was being shot in that timeframe, reportedly intimate access to Trump, his vice president, his family members, and his White House. Stephanie Grisham, who at that time was chief of staff to First Lady Melania Trump, told Rolling Stone she wasn’t aware of this documentary project either.\n\n>In other words: many of the people actually running Trump’s reelection operation are now saying they somehow had zero clue that an entire documentary was being filmed largely about Trump and his reelection campaign. And now the fruits of that doc are being mined for evidence by the congressional committee investigating Trump and his multi-pronged efforts to shred the American democratic order.\n\n>Holder released a statement later on Tuesday noting that he had “unparalleled access” to Trump and others over the final six weeks of his presidency and that he has “never-before-seen footage” of the Capitol attack. “When we began this project in September 2020, we could have never predicted that our work would one day be subpoenaed by Congress,” he wrote, adding that he had “no agenda coming into this” and only “wanted to better understand who the Trumps were and what motivated them to hold onto power so desperately.”\n\n>The subpoena from the committee requests that Holder turn over any “raw footage” filmed by him or his team on Jan. 6, 2021, as well as footage of interviews from Sept. 2020 through the present with President Trump, his children, Jared Kushner, and Vice President Mike Pence. The committee also requested any footage in Holder’s possession “pertaining to discussions of election fraud or election integrity surrounding the November 2020 presidential election.” \n\n>As a filmmaker, Holder is best known for his documentary Keep Quiet, which covered far-right Hungarian politician Csanad Szagedi’s fall from power. Szagedi was the deputy head of Hungary’s radical nationalist Jobbik party, and after years of catering to anti-semitic groups was forced to resign when his own Jewish ancestry became public knowledge.\n\n>Nick Quested, an Emmy-winning filmmaker, cooperated with the committee and testified publicly on June 9 regarding his time embedded with the Proud Boys, a far-right group involved in the attack on the Capitol. \n\n>It’s unclear if Holder will testify during the committee’s public hearings, but given that he was asked to provide footage by June 16 and is cooperating, it’s not out of the question that the committee may play some of his footage at an upcoming hearing."}