{"post_hash": "QmaeRy8ZYda5Wq7x45A5NvujDqP2Mi3e4nNBrhheeNxxow", "parent_hash": "QmaeRy8ZYda5Wq7x45A5NvujDqP2Mi3e4nNBrhheeNxxow", "parent_type": "post", "username": "88miyou88", "profile_pic": "https://styles.redditmedia.com/t5_rq7oe/styles/profileIcon_snoo34fdbf54-41d9-409c-83ff-54b543e735da-headshot.png?width=256&height=256&crop=256:256,smart&s=3e2f8325f8d5f5d6132e038bad74fdcf951f5596", "body": "to make my costume I used a fiber optic fabric bought on aliexpress  [here](https://fr.aliexpress.com/item/1005003101733798.html?spm=a2g0o.productlist.0.0.6995676baFgIkE&algo_pvid=e9203491-09d6-4c5d-9099-908597baf22a&algo_exp_id=e9203491-09d6-4c5d-9099-908597baf22a-1&pdp_ext_f=%7B%22sku_id%22%3A%2212000025025263440%22%7D&pdp_npi=2%40dis%21EUR%21%2174.39%21%21%21%21%21%402100bdd716558044811098574e28e5%2112000025025263440%21sea).\n\nI made the bustier thanks to [this](https://www.youtube.com/watch?v=49XFsbsiWvQ&t=344s) tutorial,\n\nand for the skirt, I made it with [this](https://www.youtube.com/watch?v=TkUAr0EzOtg&t=260s) tutorial!\n\nif you want to redo an outfit with this material, you must bear in mind that the fabric cannot be cut anywhere at the risk that part of your fabric no longer lights up ! (the fibers are horizontal if you buy the 100\\*140cm fabric as I took ) so remember to make all your patterns before cutting or whatever.\n\nyou also have to create an inside pocket to be able to put the battery that powers the fabric (it's not very big and there are 2, one for each side of the fabric on the one I took) and double the fabric to put the cables inside because it's not too comfortable otherwise. moreover the fabric is quite transparent\n\nalso all the pieces of fabric are connected to each other by the optical fiber so you have to place the patterns in the order of assembly. \n\nthe optical fiber will light up where there are \"tears\" in the fiber so do not bend the fabric otherwise there may be a line of light in the fabric or the fiber may break\n\nedit : I forgot to say that the LEDs are RGB so you can light up your fabrics in any color you want. and there is an app so you can manage everything on your phone! you can see mine change color [here](https://www.reddit.com/user/88miyou88/comments/vhe0mm/outfit_in_fiber_optic_in_color_mode/?utm_source=share&utm_medium=web2x&context=3) ! :)\n\nI hope that I explained well and that it is clear, tell me if something is missing! :) \nsorry for the mistakes english is not my native language!"}