{"parent_hash": "QmPX6tNTso9VUbuvX1ncr6JVzRAvAMC4CTcR1mTf5wMfaM", "username": "JuanCena175", "profile_pic": "https://styles.redditmedia.com/t5_v8pz8/styles/profileIcon_snoo17c8dfac-1126-4796-8bcb-4909a5cd0420-headshot.png?width=256&height=256&crop=256:256,smart&s=1ab6eb71572711388e8aaf836d2b454a5ba6f512", "body": "Dentist here: her braces just got off so this isn't retainer related.\n\nEither her dentist/orthodontist is shit or she is shit. \n\nWhen you want to straighten teeth you want to put teeth which usually stand crowded next to eachother. This means the arch in which the teeth stand has to increase in radius. Since you cant move teeth out of the jaw the way to do it is to let them point forward so that the root is in the jaw and the crowns align. From the front this woman has straight teeth, from the side you see where the space in the arch came from.\n\nNow this look can 100% be predicted before the start of this treatment with very basic methods. So proper treatment would've meant that premolars should've been pulled to save space and recline the front teeth into the created space. (With less teeth comes less distance in the line they will create). Sometimes however, this is not enough and jaw surgery is needed to compensate for all distances you need.\n\nThere are many patients who don't want some (usually healthy) teeth taken out, don't want to be treated longer or don't have the money for intensive treatment and who, against advice choose for a quicky. Sometimes this is the practioners fault for not explaining well enough and sometimes the patient makes a well informed decision. So not sure who is to blame in this case.\n\nI would not start treatment towards this outcome as it is often the start for a lengthy argument with the patient and maybe even a lawyer. (The patients don't know what they get themselves into) So I would definetly advice a more complex treatment with a good result, or decline treament if patient would want it this quick and easy way."}