{"parent_hash": "QmaSKRVM1xFpo4tmikspLZoksxSF9qwzUBEUUvvNtdsULf", "username": "Sir_Loinbeef", "profile_pic": "https://styles.redditmedia.com/t5_5l0ccn/styles/profileIcon_snoo0b35f9f5-d009-41ab-920d-7b1a6f1f804c-headshot.png?width=256&height=256&crop=256:256,smart&s=f80fec19a70781dfe3852bb52d792a26114f6280", "body": "His [statement](https://www.khq.com/news/jon-meis-hard-to-accept-hero-status-in-shooting/article_55f18643-2260-5678-b727-14b6adb4ccf5.html) is pretty badass as well: \n\nTo my brothers and sisters at Seattle Pacific University, and my brothers and sisters in Christ throughout the nation and the world,\n\nWords cannot come close to expressing the tragedy that occurred this past week on our campus. Like everyone else, I would hear of these horrible events on the news, but go home knowing that it could never happen to us. On Thursday, my life changed. I was thrown into a life and death situation, and through God’s grace I was able to stop the attacker and walk away unharmed. As I try to return to a normal life in the aftermath of this horrible event, I pray above all things for strength for the victims and their families. While my experience left me in physical shock, I know that many people are dealing with much greater grief than I have experienced, and in honesty I probably would not be able to handle myself right now if I had personally known the victims.\n\nI know that I am being hailed as a hero, and as many people have suggested I find this hard to accept. I am indeed a quiet and private individual; while I have imagined what it would be like to save a life I never believed I would be put in such a situation. It touches me truly and deeply to read online that parents are telling their children about me and telling them that real heroes do exist.\n\nHowever, what I find most difficult about this situation is the devastating reality that a hero cannot come without tragedy. In the midst of this attention, we cannot ignore that a life was taken from us, ruthlessly and without justification or cause. Others were badly injured, and many more will carry this event with them the rest of their lives. Nonetheless, I would encourage that hate be met with love. When I came face to face with the attacker, God gave me the eyes to see that he was not a faceless monster, but a very sad and troubled young man. While I cannot at this time find it within me to forgive his crime, I truly desire that he will find the grace of God and the forgiveness of our community.\n\nI would like to truly thank the responders who secured the building and the medical staff who looked after myself and those who were injured. After being in this situation myself, it is even harder to imagine what it would be like to have a job where one’s life is willingly put on the line every day. To our police, emergency responders, and armed forces, you have my greatest respect.\n\nI am overwhelmed with the incredible generosity that has been showered upon me. It has been deeply touching to read the comments online and realize that my actions have had such a strikingly widespread effect. Moving forward, I am strongly requesting that any future donations be given to the victims through Seattle Pacific University.\n\nI am grateful for the prayers and support coming from our home city and afar. In these next few days, weeks, and months, please continue to pray for everyone in the Seattle Pacific community. We serve a truly awesome God and I firmly believe that it is through Him alone that we will find the strength to heal from this tragedy.\n\nJon Meis\n\nStudent, Seattle Pacific University"}