{"parent_hash": "QmSJW5wPVDdfUXf8yk4UjEYVTkdx8tFeZfsPuusQ14kTbo", "username": "soldierofcinema", "profile_pic": "https://www.redditstatic.com/avatars/defaults/v2/avatar_default_0.png", "body": "To be clear, these countries have not agreed to join this project. It's wishful thinking at best. From a geopolitical point of view, I would find it almost funny to see how these countries would interact with each other. Turkey and Russia are indirectly fighting over Nagorno Kharabach and the Black Sea, while Turkey also longs for more influence over the Caucasus. Turkey and Russia are indirectly fighting in Syria and have conflicting interests since decades. Hell, Turkey has supplied Ukraine with Bayraktars. So no, this is not an amical friendship even if both countries happen to have a warmongering dictator at the steering wheel. China and Russia have border disputes and China has claimed Vladivostok in the past. Climate change will make China long for Siberia, and Russia knows it. By tying its economy to China, Russia is executing its own death sentence.\n\nChina and India are arch enemies with heavy border disputes on several places. In general, China is an untrustworthy ally (like Russia), while India is surrounded by states that are almost Chinese puppet states. For India, there are currently two threats: Pakistan and China. China's major ally is... Pakistan. China would probably even demand that Pakistan joins the club. India in itself has good historical relationships with Russia, but these ties are mainly there to counter Chinese suppremacy over the Asian continent. China would use this G8-club to strangle India into submission. People are angry with India that they are buying Russian resources at a sale, but they do not understand that many Indians live beneath the poverty line while the country has suffered from severe droughts. So it would be unwise for the West to sanction Indians. We would hugely benefit from a stronger, wealthier and safer India. Right now, China would probably steamwalse India within a few months.\n\nIndonesia and China clash over sea control (quite crucial for one of the largest island nations on the planet, one would think). Indonesia is vectoring geopolitically towards the West and the Middle East. Brazil and Mexico cannot escape from the economic, military and political power of the USA. They are neutral, but that's about it. They could cut with Russia and survive economically, but they could never cut with the USA. Iran is not a world power and has clashed severly with Turkey (albeit relationships are improving). The integration of Iran into such a G8 would cause many sunnit muslim nations (like Saudi Arabia) to join the western coalition. Geopolitics is an interesting, dynamic and difficult chess game. Russia does not play chess. It plays blackjack.\n\nAll in all, if this club would ever be created, I think it would last about two weeks."}