{"parent_hash": "QmTd6c8vyfqbrgY3GbQDf3iuUcxMeLPFAVxCospfpuaWhL", "username": "Chasith", "profile_pic": "https://styles.redditmedia.com/t5_25343f/styles/profileIcon_snoob778d339-2d08-4b1f-8f95-ac02fdac643f-headshot-f.png?width=256&height=256&crop=256:256,smart&s=2c79b585af41be3f7abec0dbcaffd9daf75aa90d", "body": "I don’t know about the experience of others, but for my first surgical procedure (in my 40’s) I had to have been warned or rechecked on this at nearly a dozen times.   I was told at the pre-surgical consultation.  It was written in my pre-surgical instructions.  I was called by the surgeon’s office the night before to go over instructions, with special focus on the food/water restrictions.  When I arrived at the hospital, it was confirmed at my intake registration.  When I was taken to my prep room to change into a gown, the nurse checked that I had complied.  When I was in pre-op and getting my IV’s and other prep work, a different nurse checked.  During the discussion with the anesthesiologist, she asked about my last eating/drinking, to the point she confirmed I didn’t swallow any water when I told her when I last brushed my teeth.  A surgical nurse asked before we went to the OR, as did my surgeon .  I believe I also signed something at some point confirming I’d followed all pre-procedure instructions.  \n\nI was scheduled for a 9am check-in with the procedure starting at 1pm.  However, it was delayed until nearly 4pm, and I was about as hangry as a person could get by the time I was put under.   \n\nImagine my surprise when I woke up in the iCU to find the surgery had been aborted because of complications (unrelated to my eating or drinking).  Despite a story or the life-saving measures they needed to perform over several hours, my main concern was getting my family to the Del Taco drive through since it was like 9pm and the hospital cafeteria was closed. \n\nDel Taco is amazing when you’re drunk, but it’s even better after a botched surgery when you’re blitzed on painkillers and haven’t eaten in nearly 24 hours."}