{"parent_hash": "QmUJ3VPaDyPEX34xvBJKRFibG6zBJt3ELkHDNudsh8KZDR", "username": "Linzo48", "profile_pic": "https://styles.redditmedia.com/t5_b2nhw/styles/profileIcon_kx5w3w9gci881.jpg?width=256&height=256&crop=256:256,smart&s=e92228b076b795ba83b56ff3dd906e94609428ab", "body": "Clone Wars was, in fact, in an earlier iteration of the script for A New Hope, despite popularized rumors that George Lucas had plans for its entry in the prequel trilogy that would come to fruition nearly thirty years later.\n\nPrior to its creation, Lucas would spend countless nights, haunted by his inability to find the right idea to latch onto that would serve as a war before the war in Star Wars. It wasn’t until one fateful sleepless night in the late autumn of 1974 while he was sitting cross legged in front of his projector writing poetry, watching film of some home porn that he made a connection. The words “As I sit watching these home whores” were written upon his parchment and he thought of words that rhymed, the first thing that came to mind was ‘clone wars’. Immediately neurons began firing like super-charged pistons in the ramparts of his mental fortress and Lucas had his epiphany, he had found his inspiration. The man tossed his poem aside and began writing Star Wars with a fervent passion, only taking breaks to shotgun cans of Coca Cola.\n\nFast forward to the first table read for The A New Hope. Everything was proceeding as Lucas had foreseen when Alec Guinness spoke up right before a forty five minute flashback sequence depicting the torture of Gungans by clone troopers, pleading: “George, I just have a terrible, terrible feeling that if we commit to this sequence, it’ll utterly spoil the clones for decades. Perhaps just have me just mention them, or some shit”.\n\nLucas, of course, who has always been irritated by quality suggestions and also hadn’t had his hourly soft drink, stood up and screamed for some “pop” and then proceeded to shove actor Kenny Baker to the floor and stormed out of the table read, beet red and muttering in broken english. This is something George historically did often, particularly during the production of the original Star Wars when he was called out, so frequently in fact that this actually led to the title of a skateboard trick called ‘Pop Shove It’.\n\nNevertheless, Lucas briefly achieved a level of nirvana and experienced what some might call a temporary ego death by contemplating the idea of dropping his clone wars flashback as well as any Gungan mutilation, the former of which in essence saved his entire Star Wars universe in the long run. He was secretly so floored by this moment that he quietly took this suggestion to producer and friend Gary Kurtz and had him covertly edit the script.\n\nIn a way, it was a result of Alec’s big brain intellect that we now have A New Hope existing as it is as well as the glorious spawn of what we now know as Attack Of The Clones. Just another genius move by George Lucas, a true visionary ahead of his time."}