{"category": "tifu", "username": "TheBoggart", "profile_pic": "https://styles.redditmedia.com/t5_bp6xe/styles/profileIcon_snoofa3bc3fc-1578-4b10-aa8b-373e09b17e80-headshot.png?width=256&height=256&crop=256:256,smart&s=611c04869c6d9d27860056cfc390e9e22962fa00", "title": "TIFU: By going down on my pregnant wife. (NSFL?)", "body": "As my twin sons’ fourth birthday approaches, I am reminded of a fuck up I had four years ago, when my wife was still quite pregnant.  I love my wife and she was more beautiful and sexy to me than ever, and I was happy to help when, as her due date approached, she frequently suggested sex as a way to induce labor.  Some sources say sex, nipple stimulation, and other things can help jumpstart contractions.  I always give her about five orgasms with my tongue before getting down to business, and this particular moment was no different.  In the past, I had noticed that when she orgasmed while pregnant, you could really see the muscles contracting from the outside of her body, with her abdomen being so taut from the pregnancy and all.  This was weird, but also kind of cool to see my handiwork in action, and I didn’t think much of that tightening other than the occasional stupid thought like, “hope it doesn’t push the babies out!”\n\nWell folks, her orgasms never pushed any babies out, but on this particular day, it did break her water.  Now, some women have a trickle, other women describe it as a sort of quick gush.  But no, this was a full on firehose blast straight to my face…into my mouth, up my nose, all over my eyes.  It was an amniotic canon shot.  That…that…ladies and gentlemen, it tasted like garlic.  I will forever hate that I know that.\n\nI’ve never quite gotten over it.  I’ve asked some people who are more knowledgeable in this kind of thing, who suggested that, while incredibly unfortunate and statistically improbable, both amniotic sacs ruptured at the same time and the contracting of muscles during the orgasm just blasted it out.  Some people beat the odds and win the lottery; I beat the odds and got hosed by a vadge.  But at least I made my wife “squirt”?\n\nTL;DR:  Tongue flicked the forbidden fruit and got blasted by garlic water.\n\n_Edits_\n\n1.  Thanks for the spelling corrections.  I’ve implemented them.\n\n2.  To address one common question: yes, I can still eat garlic.  As I explained in a comment below, I do have “one time conditioning events” that do affect me.  For example, I hate the smell of new cars because I got very sick in a new car once and now the smell of new car makes me sick every time.  But with this, I think of this incident almost every time I go down on my wife, or think about my sons’ birth, or even see a pregnant person.  So eating garlic is just one of many triggers related to this, and, as a result, it’s impact on me I think is lessened.  So yes, I can still eat garlic.\n\n3.  To address another point: yes, my wife really does orgasm about five times on average before penetration.  This is a combination of things, from my experience.  Yes, my tongue game is probably good, but she is also _capable_ of multiple orgasms (some people might not be) and it takes about five times before she’s really “finished.”  I also know her body really well and how to make her cum.  So, there’s no secret to it really!  Just practice and the right partner.", "url": "https://www.reddit.com/r/tifu/comments/vczwnb/tifu_by_going_down_on_my_pregnant_wife_nsfl/", "is_nsfw": true}