{"category": "tifu", "username": "NotAnotherPornMovie", "profile_pic": "https://www.redditstatic.com/avatars/defaults/v2/avatar_default_3.png", "title": "TIFU when I invited my gf to Adult World", "body": "Throwaway account for privacy purposes. \n\nLast week word of mouth spread about an Adult World that opened in my area. I (27m) am as vanilla as they come and sex shops never really interested me. However, that was before one was practically built in my backyard. I eventually convinced my gf (25) to check it out with me. She usually orders her sex toys online because it's more discreet, so the thought of going to an actual sex shop was somewhat out of her comfort zone. \n\nThat being said, out of all the products my gf and I saw at Adult World, the thing that really caught her eye was a random porn DVD that was not even on a shelf. It was in a crate full of other random porn DVDs. My gf pointed at the guy on the DVD cover and said she used to date him. She got excited and bought the DVD. At first she made it seem like it was nothing more than a joke. Like she was planning to watch the DVD and make fun of what's become of her ex. \n\nSo, there we were, watching a porn movie featuring the dude that dated my gf. For \"comedic purposes\". Despite being front and center on the DVD cover, the guy had one sex scene. A long sex scene. As soon as he appeared on screen, my gf covered her eyes, unable to watch her ex without feeling somewhat embarrassed. She didn't keep her eyes covered for long. \n\nBy the time all the actors were naked, my gf was not only glued to the screen, she was practically narrating the sex scene as if she was the one getting fucked. She was commenting on everything her ex was doing to the woman in the movie and comparing it to whatever they did together during their relationship. For the most part she tried to be mindful of my feelings by reminding me what an asshole her ex was and how he obviously didn't learn anything she taught him based on the way he was fucking on camera. \n\nWhatever negative opinions my gf had about her ex didn't mask the fact that I could tell how turned on she was while watching him. On the outside I was cool as fuck, but deep down the jealousy was eating me up. When the movie was finally over, my gf sent photos of the DVD cover to her friends who knew her ex when he was still dating my gf. The next day all the friends were in my living room watching the porn movie. It was like listening to a group of horny teenage girls react to a naked Timothée Chalamet. \n\nAt the time I had no idea my gf and her friends managed to find her ex online. My gf randomly mentioned it to me later that evening before showing me a recent photo of the guy. She wanted me to see that her ex no longer looked like he did in the porn movie. He was older and out of shape, but still good looking in my opinion. My gf joked about not knowing what she saw in him and what a relief it was that she didn't end up with the guy who did porn. That was less than a week ago. \n\nLo and behold this morning I got a random DM from the ex. Without wasting time getting to the point, he sent me multiple screenshots of messages that showed my gf requesting to meet up with him. Some of those messages made it clear that her intention was not just to meet up but also to hook up. He said he didn't care what I did with that information, but he would appreciate it if I tell my gf that he's blocked her on all the social media platforms she's used to harass him, and if she figures out another way to contact him, he'll used that as motivation to fuck her mom again. \n\nMy 3 year relationship came to an end less than 2 hours ago. The moment I showed my gf those screenshots, she accepted her fate and so did I. I will always wonder how our relationship would have turned out if I never encouraged her to go to Adult World with me. I thought this post was gonna be short. Shit. Sorry. I'm high. \n\n(Please don't ask for the DVD title)\n\nTL:DR Encouraged my gf to check out the new sex shop in our area. Inside said sex shop my gf discovered a porn DVD featuring her ex bf. Gf bought DVD. Enjoyed what she saw. Tried to hook up with her ex bf behind my back. Now I'm the ex bf.", "url": "https://www.reddit.com/r/tifu/comments/vcrbuh/tifu_when_i_invited_my_gf_to_adult_world/", "is_nsfw": true}