{"category": "antiwork", "username": "timopod5", "profile_pic": "https://www.redditstatic.com/avatars/defaults/v2/avatar_default_1.png", "title": "My mom's employer, United Healthcare, never called her or her emergency contacts when she suddenly stopped showing up to work. My sister found her dead a week later.", "body": "TLDR: My mom accidentally overdosed on insulin on a Monday morning and was found dead in her apartment a week later by my sister. Her employer of over 5 years did not attempt to call her personal phone once and certainly did not reach out to her emergency contacts which would have been us. She just didn't show up to work and they marked her internally for no-call-no-show.  \n\n\nShe was in a position that was highly micromanaged so there's no way they didn't know Monday morning when she didn't start working. She was a registered nurse for United Healthcare doing clinical reviews of appeals for claims United denied. It was an efficiency-focused role; she had a certain number of files to review every day and if the nurses start to fall behind (due to a complex case or technical issues) the managers are IM'ing them by noon asking why numbers are down. Her time was so micromanaged that she told me she needed to punch out to use the restroom, and if she took longer than five minutes, the managers would text her asking where she was.   \n\n\nFrom what I gather, it was a micromanaged sweatshop, but she worked there for over 5 years and seemed to be good at her job. She was offered managerial roles twice which she declined due to the toxic culture and she always received her efficiency bonuses.  \n\n\nSo it blows my mind that one day she just went completely MIA and they didn't do even the bare minimum to investigate why. My sister lived an hour away and I lived across the country. We didn't talk much during the week with work and everything so we didn't get suspicious until the weekend when my mom was not responding to texts/calls.  \n\n\nI don't think United could have saved her if they reported her missing, but they could have prevented my sister from walking in on my mom's week-old body. That is something that haunts me, that my sister had to find her like that. If they only called her emergency contacts, asked the police to check on her.. really anything, my sister finding her like that could have been avoided. But they couldn't even be bothered to call my mom's cell.", "url": "https://www.reddit.com/r/antiwork/comments/vi3bye/my_moms_employer_united_healthcare_never_called/", "is_nsfw": false}