{"category": "MaliciousCompliance", "username": "BrightRick", "profile_pic": "https://www.redditstatic.com/avatars/defaults/v2/avatar_default_5.png", "title": "Boss did not like the look of the \"bulk Mailing\" stamp, told me to remove it. Cost the company over $220K.", "body": "Back in the 1980's I worked for a sporting goods company as a catalog designer. Small company, privately owned. I was the entire advertising department. I created four catalogs a year - these were responsible for most of our mail-order sales (pre-internet) to the tune of around $700K a year.\n\nWe sent the catalogs via bulk mail using a mailing service - this let us send them for a much discounted rate. To do this required the use of a bulk mail permit, and placing the permit info on the mailing area of the catalog. Technically it's called a \"fiche.\"\n\nEnter a new boss, call him Ron. I was #1 - the only one - in my department. For some reason the company owner hired Ron as a favor to a friend. From day one he was micromanaging, questioning everything, and screwing up my very tight schedule. This was BEFORE computers were common. EVERYTHING was by hand. Literally typing out copy and reducing it on a photocopier to fit. Developing the photo film myself, making prints, etc. The actual printer had to add screens to the photos so they'd print, burn metal plates, and so on. All time consuming and expensive. Deadlines could not be missed. So I was stuck with several 16 hour days come crunch-time.\n\nI was complaining to the owner, but he really couldn't care less. I really wanted to stick it to Ron and the opportunity presented itself. Constant threats of \"my way or you're fired\" were getting to me. The latest pre-summer catalog was done (summer was our BIG season.) I had to give him my mock-up (photocopied sheets stapled together) of the final catalog for his approval - a new step added after he demanded it. He looked at it and sent it back with several pointless revisions. And a note to remove that \"ugly permit box\" because it was not needed. Where he worked previously stuffed their mailers in envelopes - the envelopes had the fiche, but their mailer did this last step. I simply asked him to initial the changes as this was the final approved version and was going to the printer the next day. There was no time to check it again. So he did. I knew it would be a total mess and it's something I would NEVER would have done in the past.\n\n50,000 catalogs printed and shipped directly to the mailer. The day they arrive at the mailer the boss gets a call from the sales rep. \"We can't mail your catalogs.\" Boss storms into my area of the building and is literally screaming. Ron is now pissed and yelling at me, joined by the boss. I swear - spittle and froth, vein bulging screaming. Minimum two week delay, wasted money, lost sales. I explain what happened, the threat to fire me, and showed the owner the changes to the final copy. Initialed by Ron. He was going to give Ron a 2nd chance until the bill came in from the printer. They had to stamp 50,000 catalogs by hand. We had to rent their permit, since that's what was on their stamp. Rental and labor was almost $8,000. Adjusted for inflation that's $20,000. Plus our early summer sales boost was off by almost $50K from previous years. Or $200K adjusted for inflation.\n\nRon WAS fired. I was left alone after that.", "url": "https://www.reddit.com/r/MaliciousCompliance/comments/vcdi8s/boss_did_not_like_the_look_of_the_bulk_mailing/", "is_nsfw": false}