{"category": "antiwork", "username": "Main-Yogurtcloset-82", "profile_pic": "https://styles.redditmedia.com/t5_4bojn5/styles/profileIcon_snooe61a08ec-207d-4a57-a584-c7c269c2b221-headshot.png?width=256&height=256&crop=256:256,smart&s=633309dac1bfe3b8c7956864cee314fac7365ce7", "title": "Had a recruiter contact me for a job and when I told them my desired salary and expectations, they got actually mad at me!", "body": "So, I'm not job searching right now, but I was about 6months ago so I still have my resume up on some job sites. I like to get alerts for jobs in my feild just to see what's out there.\n\nRight now I'm a gig worker. So I hop from job to job, but I am in a union. Avg I make between 90-120k a year. Through my union I have (as long as I'm working steadily) 100% paid for health insurance, a 401k, and a pension plan. I'm pretty happy with what I do, only thing is it can be a bit unnerving hoping job to job so I keep my eyes open for something corporate and more stable in my feild.\n\nA recruiter reached out to me through a job hiring sight I'm a member of. It was some 9-5 office job in line with my skills. She emailed me saying she was very interested in speaking to me and would like to interview me. After some back and forth the job sounded interesting enough to at least interview for. (I also went through the motions of making sure it wasn't a scam). But before we went that far I asked about pay scale. She responded with one of my biggest pet peeves, \"well what is your expected salary for such a role?\". Such a shitty way to either try and underpay someone who doesn't know how to ask for more or to pressure a person who knows their worth into taking less.\n\nSince I don't need this job and could give 2 fs I just tell her bluntly \"Right now I make around 100k/yr with a 401k and pension plan. Also my insurance premiums are 100% covered at no cost to me. So you'd have to offer me better in some way for me to have any desire to interview for the role\"\n\nWhat I got back was a very snippy email. Wont post word for word but the general jist of it was:\n\n\"That is way out of our budget for this role and quite frankly an unreasonable expectation. We are no longer interested in you as a candite for making such demands. For future endeavors I recommend you keep yourself more appealing to prospective employers by reducing your standards to something more in line with your skills. You will never find work with this attitude.\"\n\nBitch I just told you this is what I AM MAKING RIGHT NOW. It's not in your budget fine, but don't tell me what I am and am not worth. FFs", "url": "https://www.reddit.com/r/antiwork/comments/vd3xmu/had_a_recruiter_contact_me_for_a_job_and_when_i/", "is_nsfw": false}