{"category": "Superstonk", "username": "ISayBullish", "profile_pic": "https://styles.redditmedia.com/t5_4bxpgq/styles/profileIcon_na1xsj2npgv71.jpg?width=256&height=256&crop=256:256,smart&s=f91c74065aad929666ba2d61063722a181f2a68d", "title": "The reverse repo award rate going up nearly 100% at the same time inflation at 40 years high needs to go to r/all", "body": "The Reverse Repo Program (RRP) is, in layman’s terms, a program where market participants lend cash to the Federal Reserve, in exchange for an interest rate of usually 0.8% and typically overnight in exchange for Treasuries or other government securities, with a promise to buy them back.\n\nThat rate today changed from 0.8% to 1.55%. \n\nToday’s (6/15/22) RRP was over $2,000,000,000,000 (Yes. Two TRILLION dollars), so that means those market participants will get over $84,000,000 (84 million dollars) total when they return those securities tomorrow on 6/16/22. There were 96 market participants, meaning of that $84,000,000 on average the market participants will get back  approximately $875,000 tomorrow EACH. This happens on a DAILY BASIS! On average over $4,000,000 a week is going to these market participants. \n\nSo while market participants are getting nearly a million dollars daily on average, the average citizen is paying over 8% more this year for gas, food, rent, and more. \n\nOh yeah. That 8% more? Yeah… It’s most likey double digits (think 10% to 15% minimum) thanks to the Federal Reserves recalculation of what’s included in their inflation “calculations”\n\nWhen the shit TRULY hits the economic fan, don’t be angry at your neighbor for whatever their personal choices are. Be mad at those who are responsible.\n\nAs someone I know once said “To hell with the left and the right. Stop dividing the people💜”\n\nBullish\n\nEdit 1: Maf\n\nEdit 2: The point I’m trying to make is that market participants are getting paid more daily by the federal reserve while everyday people continue to be hurt by inflation\n\nI am not trying to say the RRP award is tied to inflation in any way", "url": "https://www.reddit.com/r/Superstonk/comments/vd8jeu/the_reverse_repo_award_rate_going_up_nearly_100/", "is_nsfw": false}